* Whitespace preferences
#+BEGIN_SRC emacs-lisp
(message "[kris] Loading whitespace preferences...")
(setq tab-width 4)
;; (setq-default tab-width 4)
(setq indent-tabs-mode nil)

(use-package whitespace)

;; Show trailing whitespace by default
(setq-default show-trailing-whitespace t)

;; (add-hook 'before-save-hook 'delete-trailing-whitespace)
;; ... but don't show trailing whitespace if I'm in
;; - a minibuffer
;; - help mode
;; - in a makefile
(defun hide-trailing-whitespace () (setq show-trailing-whitespace nil))
(add-hook 'minibuffer-setup-hook 'hide-trailing-whitespace)
(add-hook 'help-mode-hook 'hide-trailing-whitespace)
(add-hook 'compilation-mode-hook 'hide-trailing-whitespace)
;; (add-hook 'makefile-mode-hook 'hide-trailing-whitespace)
(add-hook 'text-mode-hook 'hide-trailing-whitespace)
(add-hook 'org-mode-hook 'hide-trailing-whitespace)
(add-hook 'shell-mode-hook 'hide-trailing-whitespace)
(add-hook 'fundamental-mode-hook 'hide-trailing-whitespace)
;; Function hide-trailing-whitespace is adapted from
;; the function no-trailing-whitespace, available:
;; https://ogbe.net/emacsconfig.html

;; This is commented out because it automatically cleans up whitespace on save
;; This can be a pain when collaborating with other people, so I have it disabled by default
;; TODO: set up to auto-enable or disable based on number of collaborators

(setq whitespace-style '(trailing space-before-tab indentation empty space-after-tab lines))
(add-hook 'prog-mode-hook 'whitespace-mode)
(add-hook 'prog-mode-hook '(lambda () (setq indent-tabs-mode nil)))
;; (setq whitespace-action '(auto-cleanup))
#+END_SRC

#+RESULTS:
| turn-on-diff-hl-mode | hs-minor-mode | highlight-indent-guides-mode | (lambda nil (setq indent-tabs-mode nil)) | whitespace-mode | flyspell-prog-mode | linum-mode |

*** config
#+BEGIN_SRC emacs-lisp
;; js2-mode
(use-package js2-mode
  :config
  (setq-default js2-basic-offset 2)
  (add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))

  ;; Better imenu
  (add-hook 'js2-mode-hook #'js2-imenu-extras-mode)
  )

;; js2-refactor
(use-package js2-refactor)


;; xref-js2
(use-package xref-js2)

(use-package typescript-mode
  :config
  (setq auto-mode-alist
        (append '(("\\.ts$" . typescript-mode)
                  ("\\.tsx$" . typescript-mode)) auto-mode-alist)))

;; Source: https://github.com/eastwood/config/blob/master/emacs.d/init.el
(defun setup-tide-mode ()
  "Set up tide mode."
  (interactive)
  (tide-setup)
  (flycheck-mode +1)
  (setq flycheck-check-syntax-automatically '(save mode-enabled))
  (eldoc-mode +1)
  (tide-hl-identifier-mode +1)
  (company-mode +1))

;; (use-package eglot
;;   :config
;;   (add-hook 'js2-mode-hook 'eglot-ensure)
;;   (add-hook 'typescript-mode-hook 'eglot-ensure))

;; Specifically for typescript as lsp mode isn't working well
(use-package tide
  :hook (typescript-mode . setup-tide-mode))


(defun kris/js-common ()
  (setq indent-tabs-mode nil)
  (setq tab-width 4)
  (setq js-indent-level 4))
(add-hook 'javascript-mode-hook 'kris/js-common)
(add-hook 'typescript-mode-hook 'kris/js-common)
(add-hook 'js2-mode-hook 'kris/js-common)


;; Set compile command to "node"

(defun kris/set-js-compile-command ()
  (set (make-local-variable 'compile-command)
       (concat "node "
	       (if buffer-file-name
		   (shell-quote-argument
		    (file-name-sans-extension buffer-file-name))))))
(add-hook 'javascript-mode-hook 'kris/set-js-compile-command)

#+END_SRC

#+RESULTS:
| kris/set-js-compile-command | kris/js-common |
